emsesp/EMS-ESP32/src/web/WebSettingsService.cpp
/*
 * EMS-ESP - https://github.com/emsesp/EMS-ESP
 * Copyright 2020-2025  emsesp.org
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "emsesp.h"

namespace emsesp {

uint16_t WebSettings::flags_ = 0;

WebSettingsService::WebSettingsService(AsyncWebServer * server, FS * fs, SecurityManager * securityManager)
    : _httpEndpoint(WebSettings::read, WebSettings::update, this, server, EMSESP_SETTINGS_SERVICE_PATH, securityManager)
    , _fsPersistence(WebSettings::read, WebSettings::update, this, fs, EMSESP_SETTINGS_FILE) {
    securityManager->addEndpoint(server, EMSESP_BOARD_PROFILE_SERVICE_PATH, AuthenticationPredicates::IS_AUTHENTICATED, [this](AsyncWebServerRequest * request) {
        board_profile(request);
    });

    addUpdateHandler([this] { onUpdate(); }, false);
}

void WebSettings::read(WebSettings & settings, JsonObject root) {
    root["version"]               = settings.version;
    root["board_profile"]         = settings.board_profile;
    root["platform"]              = EMSESP_PLATFORM;
    root["system_name"]           = settings.system_name;
    root["locale"]                = settings.locale;
    root["tx_mode"]               = settings.tx_mode;
    root["ems_bus_id"]            = settings.ems_bus_id;
    root["syslog_enabled"]        = settings.syslog_enabled;
    root["syslog_level"]          = settings.syslog_level;
    root["trace_raw"]             = settings.trace_raw;
    root["syslog_mark_interval"]  = settings.syslog_mark_interval;
    root["syslog_host"]           = settings.syslog_host;
    root["syslog_port"]           = settings.syslog_port;
    root["boiler_heatingoff"]     = settings.boiler_heatingoff;
    root["remote_timeout"]        = settings.remote_timeout;
    root["remote_timeout_en"]     = settings.remote_timeout_enabled;
    root["shower_timer"]          = settings.shower_timer;
    root["shower_alert"]          = settings.shower_alert;
    root["shower_alert_coldshot"] = settings.shower_alert_coldshot;
    root["shower_alert_trigger"]  = settings.shower_alert_trigger;
    root["shower_min_duration"]   = settings.shower_min_duration;
    root["rx_gpio"]               = settings.rx_gpio;
    root["tx_gpio"]               = settings.tx_gpio;
    root["dallas_gpio"]           = settings.dallas_gpio;
    root["dallas_parasite"]       = settings.dallas_parasite;
    root["led_gpio"]              = settings.led_gpio;
    root["hide_led"]              = settings.hide_led;
    root["led_type"]              = settings.led_type;
    root["low_clock"]             = settings.low_clock;
    root["telnet_enabled"]        = settings.telnet_enabled;
    root["notoken_api"]           = settings.notoken_api;
    root["readonly_mode"]         = settings.readonly_mode;
    root["analog_enabled"]        = settings.analog_enabled;
    root["pbutton_gpio"]          = settings.pbutton_gpio;
    root["solar_maxflow"]         = settings.solar_maxflow;
    root["fahrenheit"]            = settings.fahrenheit;
    root["bool_format"]           = settings.bool_format;
    root["bool_dashboard"]        = settings.bool_dashboard;
    root["enum_format"]           = settings.enum_format;
    root["weblog_level"]          = settings.weblog_level;
    root["weblog_buffer"]         = settings.weblog_buffer;
    root["weblog_compact"]        = settings.weblog_compact;
    root["phy_type"]              = settings.phy_type;
    root["eth_power"]             = settings.eth_power;
    root["eth_phy_addr"]          = settings.eth_phy_addr;
    root["eth_clock_mode"]        = settings.eth_clock_mode;
    root["modbus_enabled"]        = settings.modbus_enabled;
    root["modbus_port"]           = settings.modbus_port;
    root["modbus_max_clients"]    = settings.modbus_max_clients;
    root["modbus_timeout"]        = settings.modbus_timeout;
    root["developer_mode"]        = settings.developer_mode;
    root["disable_reset"]         = settings.disable_reset;
    root["email_enabled"]         = settings.email_enabled;
    root["email_security"]        = settings.email_security;
    root["email_server"]          = settings.email_server;
    root["email_port"]            = settings.email_port;
    root["email_login"]           = settings.email_login;
    root["email_pass"]            = settings.email_pass;
    root["email_sender"]          = settings.email_sender;
    root["email_recp"]            = settings.email_recp;
    root["email_subject"]         = settings.email_subject;
}

// call on initialization and also when settings are updated/saved via web or console
// note, settings is empty when the service starts
StateUpdateResult WebSettings::update(JsonObject root, WebSettings & settings) {
    // make a copy of the settings to compare to later
    const WebSettings original_settings(settings);

    // make a snapshot of the current GPIOs
    std::vector<int8_t> used_gpios;
    std::vector<int8_t> system_gpios;
    EMSESP::system_.make_snapshot_gpios(used_gpios, system_gpios);

    settings.version       = root["version"] | EMSESP_APP_VERSION; // save the version, we use it later in System::check_upgrade()
    settings.board_profile = root["board_profile"] | EMSESP_DEFAULT_BOARD_PROFILE;

    // get current values that are related to the board profile
    settings.led_gpio       = root["led_gpio"];
    settings.dallas_gpio    = root["dallas_gpio"];
    settings.rx_gpio        = root["rx_gpio"];
    settings.tx_gpio        = root["tx_gpio"];
    settings.pbutton_gpio   = root["pbutton_gpio"];
    settings.phy_type       = root["phy_type"];
    settings.eth_power      = root["eth_power"];
    settings.eth_phy_addr   = root["eth_phy_addr"];
    settings.eth_clock_mode = root["eth_clock_mode"];
    settings.led_type       = root["led_type"]; // 1 = RGB-LED

    reset_flags();

    // before loading new board profile free old gpios from used list to allow remapping
    EMSESP::system_.remove_optional_gpio(original_settings.led_gpio);
    EMSESP::system_.remove_optional_gpio(original_settings.dallas_gpio);
    EMSESP::system_.remove_gpio(original_settings.pbutton_gpio);
    EMSESP::system_.remove_optional_gpio(original_settings.rx_gpio);
    EMSESP::system_.remove_optional_gpio(original_settings.tx_gpio);

    // see if the user has changed the board profile
    // this will set: led_gpio, dallas_gpio, rx_gpio, tx_gpio, pbutton_gpio, phy_type, eth_power, eth_phy_addr, eth_clock_mode, led_type
    // this will always run when EMS-ESP starts since original_settings{} is empty
    if (original_settings.board_profile != settings.board_profile || original_settings.board_profile == "default"
        || original_settings.board_profile.length() == 0) {
        set_board_profile(settings);
        add_flags(ChangeFlags::RESTART);
    }

    check_flag(original_settings.phy_type, settings.phy_type, ChangeFlags::RESTART);
    // ETH has changed, so we need to check the ethernet pins. Only if ETH is being used.
    if (settings.phy_type != PHY_type::PHY_TYPE_NONE) {
        check_flag(original_settings.eth_power, settings.eth_power, ChangeFlags::RESTART);
        check_flag(original_settings.eth_clock_mode, settings.eth_clock_mode, ChangeFlags::RESTART);
        if (settings.eth_power != -1) { // Ethernet Power -1 means disabled
            EMSESP::system_.remove_gpio(settings.eth_power, true);
        }
        // remove the ethernet pins from valid list, regardless of whether the GPIOs are valid or not
        EMSESP::system_.remove_gpio(23, true); // MDC
        EMSESP::system_.remove_gpio(18, true); // MDIO
        EMSESP::system_.remove_gpio(19, true); // TXD0
        EMSESP::system_.remove_gpio(22, true); // TXD1
        EMSESP::system_.remove_gpio(21, true); // TXEN
        EMSESP::system_.remove_gpio(25, true); // RXD0
        EMSESP::system_.remove_gpio(26, true); // RXD1
        EMSESP::system_.remove_gpio(27, true); // CRS

        if (settings.eth_clock_mode < 2) {
            EMSESP::system_.remove_gpio(0, true); // ETH.clock input
        } else if (settings.eth_clock_mode == 2) {
            EMSESP::system_.remove_gpio(16, true); // ETH.clock output
        } else if (settings.eth_clock_mode == 3) {
            EMSESP::system_.remove_gpio(17, true); // ETH.clock output
        }
    }

    // if any of the GPIOs have changed and re-validate them
    bool have_valid_gpios = true;

