emsesp/EMS-ESP32/src/web/WebSettingsService.cpp
    // Helper lambda for optional GPIOs (can be 0 to disable)
    auto add_optional_gpio = [&have_valid_gpios](uint8_t & gpio, const char * name) {
        if (gpio != 0 && !EMSESP::system_.add_gpio(gpio, name)) {
            gpio             = 0; // 0 means disabled
            have_valid_gpios = false;
        }
    };

    // add new gpio assignment
    check_flag(original_settings.rx_gpio, settings.rx_gpio, ChangeFlags::UART);
    have_valid_gpios &= EMSESP::system_.add_gpio(settings.rx_gpio, "UART Rx");

    check_flag(original_settings.tx_gpio, settings.tx_gpio, ChangeFlags::UART);
    have_valid_gpios &= EMSESP::system_.add_gpio(settings.tx_gpio, "UART Tx");

    check_flag(original_settings.led_gpio, settings.led_gpio, ChangeFlags::LED);
    add_optional_gpio(settings.led_gpio, "LED");

    check_flag(original_settings.dallas_gpio, settings.dallas_gpio, ChangeFlags::TEMPERATURE_SENSOR);
    add_optional_gpio(settings.dallas_gpio, "Dallas");

    check_flag(original_settings.pbutton_gpio, settings.pbutton_gpio, ChangeFlags::BUTTON);
    have_valid_gpios &= EMSESP::system_.add_gpio(settings.pbutton_gpio, "Button");

    // check if the LED type, eth_phy_addr or eth_clock_mode have changed
    check_flag(original_settings.led_type, settings.led_type, ChangeFlags::LED);
    check_flag(original_settings.eth_phy_addr, settings.eth_phy_addr, ChangeFlags::RESTART);
    check_flag(original_settings.eth_clock_mode, settings.eth_clock_mode, ChangeFlags::RESTART);

    // tx_mode
    settings.tx_mode = root["tx_mode"] | EMSESP_DEFAULT_TX_MODE;
    check_flag(original_settings.tx_mode, settings.tx_mode, ChangeFlags::UART);

    // syslog
    settings.syslog_enabled = root["syslog_enabled"] | EMSESP_DEFAULT_SYSLOG_ENABLED;
    check_flag(original_settings.syslog_enabled, settings.syslog_enabled, ChangeFlags::SYSLOG);
    settings.syslog_level = root["syslog_level"] | EMSESP_DEFAULT_SYSLOG_LEVEL;
    check_flag(original_settings.syslog_level, settings.syslog_level, ChangeFlags::SYSLOG);
    settings.syslog_mark_interval = root["syslog_mark_interval"] | EMSESP_DEFAULT_SYSLOG_MARK_INTERVAL;
    check_flag(original_settings.syslog_mark_interval, settings.syslog_mark_interval, ChangeFlags::SYSLOG);
    settings.syslog_port = root["syslog_port"] | EMSESP_DEFAULT_SYSLOG_PORT;
    check_flag(original_settings.syslog_port, settings.syslog_port, ChangeFlags::SYSLOG);

#ifndef EMSESP_STANDALONE
    settings.syslog_host = root["syslog_host"] | EMSESP_DEFAULT_SYSLOG_HOST;
    if (original_settings.syslog_host != settings.syslog_host) {
        add_flags(ChangeFlags::SYSLOG);
    }
#endif

    // temperature sensor
    settings.dallas_parasite = root["dallas_parasite"] | EMSESP_DEFAULT_DALLAS_PARASITE;
    check_flag(original_settings.dallas_parasite, settings.dallas_parasite, ChangeFlags::TEMPERATURE_SENSOR);

    // shower
    settings.shower_timer = root["shower_timer"] | EMSESP_DEFAULT_SHOWER_TIMER;
    check_flag(original_settings.shower_timer, settings.shower_timer, ChangeFlags::SHOWER);
    settings.shower_alert = root["shower_alert"] | EMSESP_DEFAULT_SHOWER_ALERT;
    check_flag(original_settings.shower_alert, settings.shower_alert, ChangeFlags::SHOWER);
    settings.shower_alert_trigger = root["shower_alert_trigger"] | EMSESP_DEFAULT_SHOWER_ALERT_TRIGGER;
    check_flag(original_settings.shower_alert_trigger, settings.shower_alert_trigger, ChangeFlags::SHOWER);
    settings.shower_min_duration = root["shower_min_duration"] | EMSESP_DEFAULT_SHOWER_MIN_DURATION;
    check_flag(original_settings.shower_min_duration, settings.shower_min_duration, ChangeFlags::SHOWER);
    settings.shower_alert_coldshot = root["shower_alert_coldshot"] | EMSESP_DEFAULT_SHOWER_ALERT_COLDSHOT;
    check_flag(original_settings.shower_alert_coldshot, settings.shower_alert_coldshot, ChangeFlags::SHOWER);

    // LED
    settings.hide_led = root["hide_led"] | EMSESP_DEFAULT_HIDE_LED;
    check_flag(original_settings.hide_led, settings.hide_led, ChangeFlags::LED);

    // adc
    settings.analog_enabled = root["analog_enabled"] | EMSESP_DEFAULT_ANALOG_ENABLED;
    check_flag(original_settings.analog_enabled, settings.analog_enabled, ChangeFlags::ANALOG_SENSOR);

    // telnet, ems bus id and low clock
    settings.telnet_enabled = root["telnet_enabled"] | EMSESP_DEFAULT_TELNET_ENABLED;
    check_flag(original_settings.telnet_enabled, settings.telnet_enabled, ChangeFlags::RESTART);
    settings.ems_bus_id = root["ems_bus_id"] | EMSESP_DEFAULT_EMS_BUS_ID;
    check_flag(original_settings.ems_bus_id, settings.ems_bus_id, ChangeFlags::RESTART);
    settings.low_clock = root["low_clock"];
    check_flag(original_settings.low_clock, settings.low_clock, ChangeFlags::RESTART);

    // Modbus settings
    settings.modbus_enabled = root["modbus_enabled"] | EMSESP_DEFAULT_MODBUS_ENABLED;
    check_flag(original_settings.modbus_enabled, settings.modbus_enabled, ChangeFlags::MODBUS);
    settings.modbus_port = root["modbus_port"] | EMSESP_DEFAULT_MODBUS_PORT;
    check_flag(original_settings.modbus_port, settings.modbus_port, ChangeFlags::MODBUS);
    settings.modbus_max_clients = root["modbus_max_clients"] | EMSESP_DEFAULT_MODBUS_MAX_CLIENTS;
    check_flag(original_settings.modbus_max_clients, settings.modbus_max_clients, ChangeFlags::MODBUS);
    settings.modbus_timeout = root["modbus_timeout"] | EMSESP_DEFAULT_MODBUS_TIMEOUT;
    check_flag(original_settings.modbus_timeout, settings.modbus_timeout, ChangeFlags::MODBUS);

    //
    // these may need mqtt restart to rebuild HA discovery topics
    //
    settings.bool_format = root["bool_format"] | EMSESP_DEFAULT_BOOL_FORMAT;
    EMSESP::system_.bool_format(settings.bool_format);
    if (Mqtt::ha_enabled()) {
        check_flag(original_settings.bool_format, settings.bool_format, ChangeFlags::MQTT);
    }

    settings.enum_format = root["enum_format"] | EMSESP_DEFAULT_ENUM_FORMAT;
    EMSESP::system_.enum_format(settings.enum_format);
    if (Mqtt::ha_enabled()) {
        check_flag(original_settings.enum_format, settings.enum_format, ChangeFlags::MQTT);
    }

