emsesp/EMS-ESP32/src/web/WebSettingsService.cpp
    settings.locale = root["locale"] | EMSESP_DEFAULT_LOCALE;
    EMSESP::system_.locale(settings.locale);
    if (Mqtt::ha_enabled() && original_settings.locale != settings.locale) {
        add_flags(ChangeFlags::MQTT);
    }

    //
    // without checks or necessary restarts...
    //
    settings.system_name = root["system_name"] | EMSESP_DEFAULT_SYSTEM_NAME;

    settings.trace_raw = root["trace_raw"] | EMSESP_DEFAULT_TRACELOG_RAW;
    EMSESP::trace_raw(settings.trace_raw);

    settings.notoken_api            = root["notoken_api"] | EMSESP_DEFAULT_NOTOKEN_API;
    settings.solar_maxflow          = root["solar_maxflow"] | EMSESP_DEFAULT_SOLAR_MAXFLOW;
    settings.boiler_heatingoff      = root["boiler_heatingoff"] | EMSESP_DEFAULT_BOILER_HEATINGOFF;
    settings.remote_timeout         = root["remote_timeout"] | EMSESP_DEFAULT_REMOTE_TIMEOUT;
    settings.remote_timeout_enabled = root["remote_timeout_en"] | EMSESP_DEFAULT_REMOTE_TIMEOUT_EN;
    Roomctrl::set_timeout(settings.remote_timeout_enabled ? settings.remote_timeout : 0);

    settings.fahrenheit = root["fahrenheit"];
    EMSESP::system_.fahrenheit(settings.fahrenheit);

    settings.readonly_mode = root["readonly_mode"];
    EMSESP::system_.readonly_mode(settings.readonly_mode);

    settings.developer_mode = root["developer_mode"];
    EMSESP::system_.developer_mode(settings.developer_mode);

    settings.disable_reset = root["disable_reset"];
    EMSESP::system_.disable_reset(settings.disable_reset);

    settings.bool_dashboard = root["bool_dashboard"] | EMSESP_DEFAULT_BOOL_FORMAT;
    EMSESP::system_.bool_dashboard(settings.bool_dashboard);

    settings.weblog_level   = root["weblog_level"] | EMSESP_DEFAULT_WEBLOG_LEVEL;
    settings.weblog_compact = root["weblog_compact"] | EMSESP_DEFAULT_WEBLOG_COMPACT;

    settings.email_enabled = root["email_enabled"] | FACTORY_EMAIL_ENABLE;
    // Off is 0, so `| FACTORY_EMAIL_SECURITY` would replace it with STARTTLS (2)
    settings.email_security = root["email_security"].isNull() ? FACTORY_EMAIL_SECURITY : root["email_security"].as<uint8_t>();
    settings.email_server   = root["email_server"] | FACTORY_EMAIL_SERVER;
    settings.email_port     = root["email_port"] | FACTORY_EMAIL_PORT;
    settings.email_login    = root["email_login"] | FACTORY_EMAIL_LOGIN;
    settings.email_pass     = root["email_pass"] | FACTORY_EMAIL_PASSWORD;
    settings.email_sender   = root["email_sender"] | FACTORY_EMAIL_FROM;
    settings.email_recp     = root["email_recp"] | FACTORY_EMAIL_TO;
    settings.email_subject  = root["email_subject"] | FACTORY_EMAIL_SUBJECT;

    // if no psram limit weblog buffer to 25 messages
    const uint16_t weblog_buffer_default = (EMSESP::system_.PSram() > 0) ? EMSESP_DEFAULT_WEBLOG_BUFFER : 25;
    settings.weblog_buffer               = root["weblog_buffer"] | weblog_buffer_default;
    // a stored 0 is a valid uint16 and passes the | default above, but would make
    // limit_log_messages_ 0 in WebLogService
    if (settings.weblog_buffer == 0) {
        settings.weblog_buffer = weblog_buffer_default;
    }

    // save the settings if changed from the webUI
    // if we encountered an invalid GPIO, rollback changes and don't save settings,
    // and report the error to WebUI without a restart
    if (!have_valid_gpios) {
        // replace settings with original settings
        settings = original_settings;
        EMSESP::system_.restore_snapshot_gpios(used_gpios, system_gpios);

        // report the error to WebUI
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_INVALID_GPIO);
        return StateUpdateResult::ERROR; // don't save the settings if the GPIOs are invalid
    }

    // save the setting internally, for reference later
    EMSESP::system_.store_settings(settings);

    // and finally always write to the settings file
    if (has_flags(ChangeFlags::RESTART)) {
        return StateUpdateResult::CHANGED_RESTART;
    }

    return StateUpdateResult::CHANGED;
}

// this is called after any of the settings have been persisted to the filesystem
// either via the Web UI or via the Console
void WebSettingsService::onUpdate() {
    // skip if we're restarting anyway
    if (WebSettings::has_flags(WebSettings::ChangeFlags::RESTART)) {
        return;
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::SHOWER)) {
        EMSESP::shower_.start();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::TEMPERATURE_SENSOR)) {
        EMSESP::temperaturesensor_.start();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::UART)) {
        EMSESP::system_.uart_init();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::SYSLOG)) {
        EMSESP::system_.syslog_init(); // re-start (or stop)
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::ANALOG_SENSOR)) {
        EMSESP::analogsensor_.start();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::BUTTON)) {
        EMSESP::system_.button_init();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::LED)) {
        EMSESP::led_.init();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::MQTT)) {
        Mqtt::reset_mqtt(); // reload MQTT, init HA etc
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::MODBUS)) {
        EMSESP::system_.modbus_init();
    }
    WebSettings::reset_flags();
    EMSESP::system_.reset_unused_gpios();
}

void WebSettingsService::begin() {
    _fsPersistence.readFromFS();
}

void WebSettingsService::save() {
    _fsPersistence.writeToFS();
}

// send the board profile as JSON
void WebSettingsService::board_profile(AsyncWebServerRequest * request) {
    if (request->hasParam("boardProfile")) {
        std::string board_profile = request->getParam("boardProfile")->value().c_str();

        auto *     response = new PsramAsyncJsonResponse(false);
        JsonObject root     = response->getRoot();

        // 0=led, 1=dallas, 2=rx, 3=tx, 4=button, 5=phy_type, 6=eth_power, 7=eth_phy_addr, 8=eth_clock_mode, 9=led_type
        std::vector<int8_t> data;
        (void)System::load_board_profile(data, board_profile);
        root["board_profile"]  = board_profile;
        root["led_gpio"]       = data[0];
        root["dallas_gpio"]    = data[1];
        root["rx_gpio"]        = data[2];
        root["tx_gpio"]        = data[3];
        root["pbutton_gpio"]   = data[4];
        root["phy_type"]       = data[5];
        root["eth_power"]      = data[6];
        root["eth_phy_addr"]   = data[7];
        root["eth_clock_mode"] = data[8];
        root["led_type"]       = data[9];

