emsesp/EMS-ESP32/src/web/WebSettingsService.cpp
        response->setLength();
        request->send(response);
        return;
    }

    AsyncWebServerResponse * response = request->beginResponse(200);
    request->send(response);
}

// loads the board profile to set the gpios
// if the board profile is not found, or default, it will try to autodetect the board profile
void WebSettings::set_board_profile(WebSettings & settings) {
    // The optional NVS boot value has priority and overrides any board_profile setting.
    // This is only done for BBQKees boards
    // Note 1: we never set the NVS boot value in the code - this is done on initial pre-loading
    // Note 2: The board profile is dynamically changed for the session, but the value in the settings file on the FS remains untouched
    if (EMSESP::system_.getBBQKeesGatewayDetails(FUSE_VALUE::MFG).startsWith("BBQKees")) {
        String bbq_board = EMSESP::system_.getBBQKeesGatewayDetails(FUSE_VALUE::BOARD);
        if (!bbq_board.isEmpty() && settings.board_profile != "CUSTOM") {
#if defined(EMSESP_DEBUG)
            EMSESP::logger().info("Overriding board profile with fuse value %s", bbq_board.c_str());
#endif
            settings.board_profile = bbq_board;
        }
    }

    // if it's CUSTOM no need to load the board profile from the settings
    // as it's already set
    if (settings.board_profile == "CUSTOM") {
        EMSESP::logger().info("Using CUSTOM board profile");
        EMSESP::system_.set_valid_system_gpios();
        return;
    }

    // load the board profile into the data vector
    // 0=led, 1=dallas, 2=rx, 3=tx, 4=button, 5=phy_type, 6=eth_power, 7=eth_phy_addr, 8=eth_clock_mode, 9=led_type
    std::vector<int8_t> data(10, 99); // initialize with 99 for all values, just as a safe guard to catch bad gpios
    if (settings.board_profile != "default") {
        if (!System::load_board_profile(data, settings.board_profile.c_str())) {
#if defined(EMSESP_DEBUG)
            EMSESP::logger().debug("Unable to identify board profile %s", settings.board_profile.c_str());
#endif
            settings.board_profile = "default"; // can't find profile, fallback to "default"
        }
    }

    // we still don't have a valid board profile. Let's see if we can determine one from the build config or hardware
    if (settings.board_profile == "default") {
        EMSESP::logger().info("Autodetecting board profile");
#if CONFIG_IDF_TARGET_ESP32
        // check for no PSRAM, could be a E32 or S32?
        if (!ESP.getPsramSize()) {
            if (ETH.begin(ETH_PHY_LAN8720, 1, 23, 18, 16, ETH_CLOCK_GPIO0_IN)) {
                settings.board_profile = "E32"; // Ethernet without PSRAM
            } else {
                settings.board_profile = "S32"; // ESP32 standard WiFi without PSRAM
            }
        } else {
            // check for boards with PSRAM, could be a E32V2 otherwise default back to the S32
            if (ETH.begin(ETH_PHY_LAN8720, 0, 23, 18, 15, ETH_CLOCK_GPIO0_OUT)) {
                if (analogReadMilliVolts(39) > 700) {   // core voltage > 2.6V
                    settings.board_profile = "E32V2_2"; // Ethernet, PSRAM, internal sensors
                } else {
                    settings.board_profile = "E32V2"; // Ethernet and PSRAM
                }
            } else {
                settings.board_profile = "S32"; // ESP32 standard WiFi with PSRAM
            }
        }
// override if we know the target from the build config like C3, S2, S3 etc..
#elif CONFIG_IDF_TARGET_ESP32C3
        settings.board_profile = "C3MINI";
#elif CONFIG_IDF_TARGET_ESP32S2
        settings.board_profile = "S2MINI";
#elif CONFIG_IDF_TARGET_ESP32S3
        settings.board_profile = "S32S3"; // BBQKees Gateway S3
#elif CONFIG_IDF_TARGET_ESP32C6
        settings.board_profile = "CUSTOM";
#endif
        // apply the new board profile setting
        System::load_board_profile(data, settings.board_profile.c_str());
    }

// log board profile and PSRAM info
#ifndef EMSESP_STANDALONE
    uint32_t psram_size = ESP.getPsramSize() / 1024; // in KB
    if (psram_size > 0) {
        EMSESP::logger().info("Loaded board profile %s (PSRAM: %lu KB)", settings.board_profile.c_str(), psram_size);
    } else {
        EMSESP::logger().info("Loaded board profile %s (PSRAM: not available)", settings.board_profile.c_str());
    }
#endif

    // apply the new board profile settings
    // 0=led, 1=dallas, 2=rx, 3=tx, 4=button, 5=phy_type, 6=eth_power, 7=eth_phy_addr, 8=eth_clock_mode, 9=led_type
    settings.led_gpio       = data[0]; // LED GPIO
    settings.dallas_gpio    = data[1]; // Dallas GPIO
    settings.rx_gpio        = data[2]; // UART Rx GPIO
    settings.tx_gpio        = data[3]; // UART Tx GPIO
    settings.pbutton_gpio   = data[4]; // Button GPIO
    settings.phy_type       = data[5]; // PHY Type
    settings.eth_power      = data[6]; // Ethernet Power GPIO
    settings.eth_phy_addr   = data[7]; // Ethernet PHY Address
    settings.eth_clock_mode = data[8]; // Ethernet Clock Mode
    settings.led_type       = data[9]; // LED Type
}

// returns true if the value was changed
bool WebSettings::check_flag(int prev_v, int new_v, uint16_t flag) {
    if (prev_v != new_v) {
        add_flags(flag);
#if defined(EMSESP_DEBUG)
        // EMSESP::logger().debug("check_flag: flag %d, prev_v=%d, new_v=%d", flag, prev_v, new_v);
#endif
        return true;
    }
    return false;
}

void WebSettings::add_flags(uint16_t flags) {
    flags_ |= flags;
}

bool WebSettings::has_flags(uint16_t flags) {
    return (flags_ & flags) == flags;
}

void WebSettings::reset_flags() {
    flags_ = ChangeFlags::NONE;
}

uint16_t WebSettings::get_flags() {
    return flags_;
}

} // namespace emsesp
